import math   #імпортуємо заради деяких математичних дій

a=float(input("Введіть довжину катета 'a': "))  #сторони прямокутника
while a<=0:                                     #мають бути додатними
    a=float(input("Введіть число більше нуля: "))  

b=float(input("Введіть довжину катета 'b': "))
while b<=0:
    b=float(input("Введіть число більше нуля: "))

c=math.sqrt((a**2)+(b**2))  #знаходимо гіпотенузу

P=a+b+c  #знаходимо периметр

S=a*b/2  #знаходимо площу

print("Периметр: ", P)
print("Площа: ", S)
